import React from "react";

export default function Contact() {
  return (
    <div id="contacts" className=" my-4 ">
      <section className=" bg-[#F9F9F9] my-3 px-5 py-16 text-center ">
        <h1 className=" text-[32px] font-[600] text-[#101828] mb-3 ">
          تواصل معنا
        </h1>
        <h1 className=" text-[18px] font-[500] text-[#475467] ">
          نحن نحب أن نسمع منك. يرجى ملء هذا النموذج.
        </h1>
      </section>
      <section className=" grid grid-cols-1 md:grid-cols-2 gap-3 ">
        <section className=" bg-[#F9F9F9] px-5 py-8 text-center ">
          <section className=" mx-auto flex items-center justify-center rounded-full bg-white h-[100px] w-[100px] ">
            <section className=" mx-auto flex items-center justify-center rounded-full bg-[#3D4D4A] h-[58px] w-[58px] ">
              <svg
                width="19"
                height="18"
                viewBox="0 0 19 18"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M4.12 7.79C5.56 10.62 7.88 12.93 10.71 14.38L12.91 12.18C13.18 11.91 13.58 11.82 13.93 11.94C15.05 12.31 16.26 12.51 17.5 12.51C18.05 12.51 18.5 12.96 18.5 13.51V17C18.5 17.55 18.05 18 17.5 18C8.11 18 0.5 10.39 0.5 1C0.5 0.45 0.95 0 1.5 0H5C5.55 0 6 0.45 6 1C6 2.25 6.2 3.45 6.57 4.57C6.68 4.92 6.6 5.31 6.32 5.59L4.12 7.79Z"
                  fill="white"
                />
              </svg>
            </section>
          </section>
          <h1 className=" text-[18px] font-[400] text-[#344054] my-1 ">
            الجوال
          </h1>

          <h1 className=" text-[18px] font-[400] text-[#344054] my-1 ">
            {`201069404880`}+
          </h1>

          <h1 className=" text-[18px] font-[400] text-[#344054] my-1 ">
            متوفرون خلال 24 ساعة
          </h1>
        </section>
        <section className=" bg-[#F9F9F9] px-5 py-8 text-center ">
          <section className=" mx-auto flex items-center justify-center rounded-full bg-white h-[100px] w-[100px] ">
            <section className=" mx-auto flex items-center justify-center rounded-full bg-[#3D4D4A] h-[58px] w-[58px] ">
              <svg
                width="20"
                height="16"
                viewBox="0 0 20 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M18 0H2C0.9 0 0.00999999 0.9 0.00999999 2L0 14C0 15.1 0.9 16 2 16H18C19.1 16 20 15.1 20 14V2C20 0.9 19.1 0 18 0ZM18 4L10 9L2 4V2L10 7L18 2V4Z"
                  fill="white"
                />
              </svg>
            </section>
          </section>
          <h1 className=" text-[18px] font-[400] text-[#344054] my-1 ">
            البريد الالكتروني
          </h1>

          <h1 className=" text-[18px] font-[400] text-[#344054] my-1 ">
            <a href="mailto:Zekraacademy@gmail.com" className="hover:underline">Zekraacademy@gmail.com</a>
          </h1>

          <h1 className=" text-[18px] font-[400] text-[#344054] my-1 ">
            يسعدنا تواصلك البريد الالكتروني
          </h1>
        </section>
      </section>

      <section className="flex justify-center my-24">
        <a href="https://wa.me/201069404880">
          <button className="flex items-center gap-4 px-[46px] py-[20px] text-white transition-all duration-300 ease-in-out bg-[#3D4D4A] rounded-[20px] text-[15px] hover:bg-[#2c3a38]">
            <svg
              width="43"
              height="44"
              viewBox="0 0 43 44"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M21.5017 4.08398C31.397 4.08398 39.4183 12.1053 39.4183 22.0007C39.4183 31.896 31.397 39.9173 21.5017 39.9173C18.3353 39.9228 15.2247 39.0848 12.4896 37.4896L3.59216 39.9173L6.01449 31.0163C4.41804 28.2803 3.57944 25.1683 3.58499 22.0007C3.58499 12.1053 11.6063 4.08398 21.5017 4.08398ZM15.3957 13.5798L15.0373 13.5942C14.8056 13.6101 14.5793 13.671 14.3708 13.7733C14.1766 13.8835 13.9992 14.0211 13.8441 14.1818C13.6291 14.3843 13.5072 14.5599 13.3764 14.7301C12.7137 15.5917 12.3569 16.6495 12.3624 17.7365C12.3659 18.6144 12.5953 19.469 12.9536 20.2681C13.6864 21.8842 14.8922 23.5952 16.4832 25.1809C16.8666 25.5625 17.2429 25.9459 17.6478 26.3024C19.6248 28.0429 21.9805 29.2981 24.5278 29.9682L25.5454 30.1241C25.8769 30.142 26.2084 30.1169 26.5416 30.1008C27.0633 30.0733 27.5727 29.932 28.0341 29.6869C28.2685 29.5657 28.4975 29.4342 28.7203 29.2927C28.7203 29.2927 28.7961 29.2414 28.9442 29.1315C29.1861 28.9523 29.3348 28.8251 29.5355 28.6155C29.686 28.4602 29.8114 28.2798 29.9117 28.0744C30.0515 27.7824 30.1912 27.2251 30.2486 26.7611C30.2916 26.4064 30.279 26.2129 30.2737 26.0928C30.2665 25.9011 30.107 25.7022 29.9332 25.618L28.8905 25.1504C28.8905 25.1504 27.3317 24.4714 26.3786 24.0378C26.2788 23.9943 26.1719 23.9694 26.0632 23.9643C25.9406 23.9515 25.8167 23.9652 25.6999 24.0044C25.583 24.0437 25.476 24.1076 25.386 24.1919C25.377 24.1883 25.257 24.2904 23.9616 25.8599C23.8873 25.9598 23.7849 26.0353 23.6674 26.0768C23.55 26.1183 23.4229 26.1239 23.3023 26.0928C23.1855 26.0617 23.0711 26.0222 22.9601 25.9746C22.7379 25.8814 22.6609 25.8456 22.5086 25.7811C21.4799 25.333 20.5278 24.7266 19.6867 23.984C19.4609 23.7869 19.2513 23.5719 19.0363 23.3641C18.3315 22.689 17.7172 21.9254 17.2088 21.0923L17.1031 20.9221C17.0283 20.807 16.967 20.6838 16.9204 20.5548C16.8523 20.2914 17.0297 20.08 17.0297 20.08C17.0297 20.08 17.465 19.6034 17.6675 19.3454C17.8646 19.0946 18.0312 18.8509 18.1387 18.6771C18.3501 18.3367 18.4164 17.9873 18.3053 17.7168C17.8037 16.4913 17.2853 15.2723 16.7502 14.06C16.6444 13.8199 16.3309 13.6479 16.046 13.6139C15.9493 13.6019 15.8525 13.5924 15.7558 13.5852C15.5152 13.5714 15.274 13.5738 15.0337 13.5924L15.3957 13.5798Z"
                fill="#5AA794"
              />
            </svg>
            تواصل معنا من خلال الواتساب
          </button>
        </a>
      </section>
    </div>
  );
}
